In [5]:
import pandas as pd
import numpy as np
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
data=pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='str')

In [8]:
data.loc['a':],data.iloc[3]

(a    1
 b    2
 c    3
 d    4
 e    5
 dtype: int64,
 np.int64(4))

In [9]:
data.loc[['a', 'c', 'e']],data.iloc[[0, 2, 4]]

(a    1
 c    3
 e    5
 dtype: int64,
 a    1
 c    3
 e    5
 dtype: int64)

In [14]:
dictionary={
"usn":[1,2,3,4],
"name":["sanket","suprita","sujay","sakshi"],
"age":[20,21,22,23],
"branch":["cse","ise","ece","mech"]
}
df=pd.DataFrame(dictionary)
df

   usn     name  age branch
0    1   sanket   20    cse
1    2  suprita   21    ise
2    3    sujay   22    ece
3    4   sakshi   23   mech

In [15]:
data=pd.read_csv(r'C:\\Users\\Sanketreddy\\Downloads\\sample.csv')
data

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1
5,5,106,John,Finance,29,58000,3,2021-11-05,Delhi,3.9
6,6,107,Meena,IT,41,82000,15,2010-04-18,Bangalore,4.8
7,7,108,David,HR,26,48000,2,2022-02-14,Mumbai,3.7
8,8,109,Sara,Finance,38,61000,12,2013-12-01,Delhi,4.3
9,9,110,Arjun,IT,27,54000,4,2020-08-19,Bangalore,4.0
10,10,111,Ravi,HR,33,47000,6,2017-05-23,Mumbai,3.6
11,11,112,Priya,Finance,31,59000,5,2019-09-17,Delhi,4.4
12,12,113,Kunal,IT,45,90000,18,2008-03-11,Bangalore,4.9
13,13,114,Sneha,HR,29,51000,3,2021-07-29,Mumbai,3.5
14,14,115,Vijay,Finance,36,62000,11,2014-01-10,Delhi,4.2
15,15,116,Neha,IT,40,88000,14,2011-10-21,Bangalore,4.7
16,16,117,Amit,HR,34,53000,8,2016-04-05,Mumbai,4.0
17,17,118,Pooja,Finance,30,57000,6,2018-12-12,Delhi,4.1
18,18,119,Rahul,IT,28,56000,4,2020-02-28,Bangalore,3.9
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [16]:
data.tail(10)

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
10,10,111,Ravi,HR,33,47000,6,2017-05-23,Mumbai,3.6
11,11,112,Priya,Finance,31,59000,5,2019-09-17,Delhi,4.4
12,12,113,Kunal,IT,45,90000,18,2008-03-11,Bangalore,4.9
13,13,114,Sneha,HR,29,51000,3,2021-07-29,Mumbai,3.5
14,14,115,Vijay,Finance,36,62000,11,2014-01-10,Delhi,4.2
15,15,116,Neha,IT,40,88000,14,2011-10-21,Bangalore,4.7
16,16,117,Amit,HR,34,53000,8,2016-04-05,Mumbai,4.0
17,17,118,Pooja,Finance,30,57000,6,2018-12-12,Delhi,4.1
18,18,119,Rahul,IT,28,56000,4,2020-02-28,Bangalore,3.9
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [17]:
data.head(10)

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1
5,5,106,John,Finance,29,58000,3,2021-11-05,Delhi,3.9
6,6,107,Meena,IT,41,82000,15,2010-04-18,Bangalore,4.8
7,7,108,David,HR,26,48000,2,2022-02-14,Mumbai,3.7
8,8,109,Sara,Finance,38,61000,12,2013-12-01,Delhi,4.3
9,9,110,Arjun,IT,27,54000,4,2020-08-19,Bangalore,4.0

In [18]:
data.shape

(20, 10)

In [19]:
data.sample(2)

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
7,7,108,David,HR,26,48000,2,2022-02-14,Mumbai,3.7

In [20]:
data.Name

0       Ram
1     Shyam
2     Geeta
3     Anita
4     Kiran
5      John
6     Meena
7     David
8      Sara
9     Arjun
10     Ravi
11    Priya
12    Kunal
13    Sneha
14    Vijay
15     Neha
16     Amit
17    Pooja
18    Rahul
19    Divya
Name: Name, dtype: str

In [21]:
data[["Name","Department"]]

     Name Department
0     Ram         IT
1   Shyam         HR
2   Geeta    Finance
3   Anita         IT
4   Kiran         HR
5    John    Finance
6   Meena         IT
7   David         HR
8    Sara    Finance
9   Arjun         IT
10   Ravi         HR
11  Priya    Finance
12  Kunal         IT
13  Sneha         HR
14  Vijay    Finance
15   Neha         IT
16   Amit         HR
17  Pooja    Finance
18  Rahul         IT
19  Divya         HR

In [22]:
data[["Name","Department"]].head(2)

    Name Department
0    Ram         IT
1  Shyam         HR

In [23]:
type(data.Name)

pandas.Series

In [24]:
data=pd.read_csv(r'C:\\Users\\Sanketreddy\\Downloads\\test2.csv')
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [25]:
data.isnull()

   Unnamed: 0   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False   True       False   False
4       False  False  False       False    True
5       False  False  False       False   False

In [26]:
data.loc[:, ["Name", "Department", "Salary"]]

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [27]:
data.loc[1:3, ["Name", "Department", "Salary"]]

      Name Department   Salary
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0

In [28]:
data.iloc[1:4,1:4]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [43]:
data.isnull()

    Name    Age  Department  Salary
0  False  False       False   False
1  False  False       False   False
2  False  False       False   False
3  False   True       False   False
4  False  False       False    True
5  False  False       False   False

In [55]:
data=pd.read_csv(r'C:\\Users\\Sanketreddy\\Downloads\\test2.csv')
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [56]:
data.drop('Unnamed: 0',axis=1,inplace=True)
data

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [58]:
data["Updated_Salary"]=data["Salary"]+5000
data

      Name   Age Department   Salary  Updated_Salary
0    Alice  25.0         HR  50000.0         55000.0
1      Bob  30.0         IT  60000.0         65000.0
2  Charlie  35.0    Finance  70000.0         75000.0
3    David   NaN         IT  62000.0         67000.0
4      Eve  29.0         HR      NaN             NaN
5    Alice  25.0         HR  50000.0         55000.0

In [67]:
data["Age"] = data.Age.astype("Int64")
data[data["Age"]>25]
data

      Name   Age Department   Salary  Updated_Salary
0    Alice    25         HR  50000.0         55000.0
1      Bob    30         IT  60000.0         65000.0
2  Charlie    35    Finance  70000.0         75000.0
3    David  <NA>         IT  62000.0         67000.0
4      Eve    29         HR      NaN             NaN
5    Alice    25         HR  50000.0         55000.0

In [71]:
data["Age"].mean()

np.float64(28.8)

In [76]:
data

      Name   Age Department   Salary  Updated_Salary
0    Alice    25         HR  50000.0         55000.0
1      Bob    30         IT  60000.0         65000.0
2  Charlie    35    Finance  70000.0         75000.0
3    David  <NA>         IT  62000.0         67000.0
4      Eve    29         HR      NaN             NaN
5    Alice    25         HR  50000.0         55000.0

In [81]:
data=pd.read_csv(r'C:\\Users\\Sanketreddy\\Downloads\\test2.csv')
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [83]:
data["Age"]=data["Age"].fillna(value=data["Age"].mean())
data["Salary"]=data["Salary"].fillna(value=data["Salary"].mean())
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [85]:
data["Age"]=data["Age"].fillna(value=data["Age"].mean())
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [86]:
data["Age"]=data["Age"].fillna(value=data["Age"].mean())
data["Age"].mean

<bound method Series.mean of 0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64>

In [87]:
data["Salary"].mean

<bound method Series.mean of 0    50000.0
1    60000.0
2    70000.0
3    62000.0
4    58400.0
5    50000.0
Name: Salary, dtype: float64>

In [88]:
data.Age.ffill()

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [90]:
data["Updated_Salary"]=data["Salary"].apply(lambda x:x+500)
data

   Unnamed: 0     Name   Age Department   Salary  Updated_Salary
0           0    Alice  25.0         HR  50000.0         50500.0
1           1      Bob  30.0         IT  60000.0         60500.0
2           2  Charlie  35.0    Finance  70000.0         70500.0
3           3    David  28.8         IT  62000.0         62500.0
4           4      Eve  29.0         HR  58400.0         58900.0
5           5    Alice  25.0         HR  50000.0         50500.0

In [92]:
data["level"]=data.apply(lambda row:"High" if row["Salary"]>60000 else "Low", axis=1)
data

   Unnamed: 0     Name   Age Department   Salary  Updated_Salary level
0           0    Alice  25.0         HR  50000.0         50500.0   Low
1           1      Bob  30.0         IT  60000.0         60500.0   Low
2           2  Charlie  35.0    Finance  70000.0         70500.0  High
3           3    David  28.8         IT  62000.0         62500.0  High
4           4      Eve  29.0         HR  58400.0         58900.0   Low
5           5    Alice  25.0         HR  50000.0         50500.0   Low

In [93]:
data.groupby("Department")["Salary"].mean()

Department
Finance    70000.0
HR         52800.0
IT         61000.0
Name: Salary, dtype: float64

In [98]:
filtered=data[(data["Age"]>28) & (data["Salary"]>60000)]
filtered

   Unnamed: 0     Name   Age Department   Salary  Updated_Salary level
2           2  Charlie  35.0    Finance  70000.0         70500.0  High
3           3    David  28.8         IT  62000.0         62500.0  High

In [3]:
pip install pandas

Collecting pandas
  Downloading pandas-3.0.0-cp314-cp314-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=2.3.3 in c:\users\sanketreddy\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2.4.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sanketreddy\appdata\roaming\python\python314\site-packages (from pandas) (2.9.0.post0)
Collecting tzdata (from pandas)
  Downloading tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\sanketreddy\appdata\roaming\python\python314\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-3.0.0-cp314-cp314-win_amd64.whl (9.9 MB)
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   - -------------------------------------- 0.3/9.9 MB ? eta -:--:--
   - -------------------------------------- 0.3/9.9 MB ? eta -:--:--
   -- ------------------------------------- 0.5/9.9 MB 844.3 kB/s eta 0:00:12
   -- ------------------------------------- 0.5/9.9 MB 844.3 kB/s eta 0:00:12
   --- ------------------------------------ 0.8/9.9 MB 652.2 kB/s eta 0:00:14
   --- ------------------------------------ 0.8/9.9 MB 652.2 kB/s eta 0:00:14
   ----- ---------------------------------- 1.3/9.9 MB 848.0 kB/s eta 0:00:11
   ------ --------------------------------- 1.6/9.9 MB 870.3 kB/s eta 0:00:10
   ------ --------------------------------- 1.6/9.9 MB 870.3 kB/s eta 0:00:10
   --------- ------------------------------ 2.4/9.9 MB 1.1 MB/s eta 0:00:07
   --------- ------------------------------ 2.4/9.9 MB 1.1 MB/s eta 0:00:07
   ---------- ----------------------------- 2.6/9.9 MB 979.3 kB/s eta 0:00:08
   ---------- ----------------------------- 2.6/9.9 MB 979.3 kB/s eta 0:00:08
   ---------- ----------------------------- 2.6/9.9 MB 979.3 kB/s eta 0:00:08
   ----------------- ---------------------- 4.2/9.9 MB 1.3 MB/s eta 0:00:05
   ------------------ --------------------- 4.5/9.9 MB 1.3 MB/s eta 0:00:05
   -------------------- ------------------- 5.0/9.9 MB 1.4 MB/s eta 0:00:04
   ---------------------- ----------------- 5.5/9.9 MB 1.4 MB/s eta 0:00:04
   ----------------------- ---------------- 5.8/9.9 MB 1.5 MB/s eta 0:00:03
   ------------------------ --------------- 6.0/9.9 MB 1.4 MB/s eta 0:00:03
   ------------------------ --------------- 6.0/9.9 MB 1.4 MB/s eta 0:00:03
   ---------------------------- ----------- 7.1/9.9 MB 1.5 MB/s eta 0:00:02
   ----------------------------- ---------- 7.3/9.9 MB 1.5 MB/s eta 0:00:02
   ------------------------------ --------- 7.6/9.9 MB 1.5 MB/s eta 0:00:02
   ---------------------------------- ----- 8.4/9.9 MB 1.6 MB/s eta 0:00:01
   ------------------------------------ --- 8.9/9.9 MB 1.6 MB/s eta 0:00:01
   -------------------------------------- - 9.4/9.9 MB 1.7 MB/s eta 0:00:01
   ---------------------------------------- 9.9/9.9 MB 1.7 MB/s  0:00:06
Downloading tzdata-2025.3-py2.py3-none-any.whl (348 kB)
Installing collected packages: tzdata, pandas

   ---------------------------------------- 0/2 [tzdata]
   ---------------------------------------- 0/2 [tzdata]
   ---------------------------------------- 0/2 [tzdata]
   ---------------------------------------- 0/2 [tzdata]
   ---------------------------------------- 0/2 [tzdata]
   ---------------------------------------- 0/2 [tzdata]
   ---------------------------------------- 0/2 [tzdata]
   ---------------------------------------- 0/2 [tzdata]
   ---------------------------------------- 0/2 [tzdata]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   ---------------------------------------- 2/2 [pandas]

Successfully installed pandas-3.0.0 tzdata-2025.3
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.3 -> 26.0
[notice] To update, run: python.exe -m pip install --upgrade pip